In [8]:
!pip install pandas
!pip install openpyxl

Requirement already satisfied: pandas in c:\users\naiara cynira\envs\myenv\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\naiara cynira\envs\myenv\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\naiara cynira\envs\myenv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\naiara cynira\envs\myenv\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\naiara cynira\envs\myenv\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\naiara cynira\envs\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3.1 -> 23.3.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
     - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
     ------ ------------------------------ 41.0/250.0 kB 487.6 kB/s eta 0:00:01
     ---------------------------------- --- 225.3/250.0 kB 2.0 MB/s eta 0:00:01
     -------------------------------------- 250.0/250.0 kB 2.2 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip is available: 23.3.1 -> 23.3.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import pandas as pd
import openpyxl

Usando o arquivo "best-selling game consoles.xlsx"

In [10]:
nintendo = r"C:\Users\Naiara Cynira\best-selling_game_consoles.xlsx"
nintendo

'C:\\Users\\Naiara Cynira\\best-selling_game_consoles.xlsx'

conte quantos consoles tem na base por companhias.

In [12]:
df = pd.read_excel(nintendo, sheet_name="consoles")
nintendo

'C:\\Users\\Naiara Cynira\\best-selling_game_consoles.xlsx'

In [13]:
contagem = df.groupby('Company')[['Company']].count()
contagem

                         Company
Company
Atari                          4
Bandai                         1
Coleco                         2
Magnavox/Philips               1
Mattel                         1
Micro Genius                   1
Microsoft                      4
NEC                            1
NEC/Hudson Soft[note 6]        1
Nintendo                      17
Nokia                          1
Philips                        1
Sega                           7
Sony                           7
Tectoy                         2

Ordene o resultado anterior pela quantidade de consoles por companhia de forma decrescente.

In [14]:
quantidade_console = ['qtd']

In [15]:
contagem_console = df.groupby('Company')['Company'].count().sort_values(ascending=False).reset_index(name='qtd')
contagem_console

                    Company  qtd
0                  Nintendo   17
1                      Sega    7
2                      Sony    7
3                     Atari    4
4                 Microsoft    4
5                    Coleco    2
6                    Tectoy    2
7                    Bandai    1
8          Magnavox/Philips    1
9                    Mattel    1
10             Micro Genius    1
11                      NEC    1
12  NEC/Hudson Soft[note 6]    1
13                    Nokia    1
14                  Philips    1

Sobre o dataframe anterior, adicione a coluna "Market Value" presente na tabela do arquivo "company.txt".

In [17]:
valores = pd.read_csv(r"C:\Users\Naiara Cynira\Desktop\company.txt")
valores

                    Company  Market Value
0                     Atari          4160
1                    Bandai           913
2                    Coleco           767
3          Magnavox/Philips           693
4                    Mattel           548
5              Micro Genius           689
6                 Microsoft          3154
7                       NEC           387
8   NEC/Hudson Soft[note 6]           547
9                  Nintendo         22615
10                    Nokia           637
11                  Philips           899
12                     Sega         10391
13                     Sony          7177
14                   Tectoy          2538

In [19]:
companhias_valores = contagem_console.merge(valores, on='Company', how='left')
companhias_valores

                    Company  qtd  Market Value
0                  Nintendo   17         22615
1                      Sega    7         10391
2                      Sony    7          7177
3                     Atari    4          4160
4                 Microsoft    4          3154
5                    Coleco    2           767
6                    Tectoy    2          2538
7                    Bandai    1           913
8          Magnavox/Philips    1           693
9                    Mattel    1           548
10             Micro Genius    1           689
11                      NEC    1           387
12  NEC/Hudson Soft[note 6]    1           547
13                    Nokia    1           637
14                  Philips    1           899

Qual o valor médio de Market Value por console?

In [21]:
soma = companhias_valores.sum()
soma

Valor médio de Market Value por console: 1100.2941176470588

In [22]:
print("Valor médio de Market Value por console:", soma['Market Value']/soma['qtd'])

Valor médio de Market Value por console: 1100.2941176470588